mcu-coder/stm32_smart_curtains2/1.智能窗帘程序/HARDWARE/KEY/key.c
#include "stdio.h"
#include "stm32f10x.h"
#include "key.h"
#include "sys.h" 
#include "delay.h"
//#include "flash.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK精英STM32开发板
//按键驱动代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//修改日期:2012/9/3
//版本：V1.0
//版权所有，盗版必究。
//Copyright(C) 广州市星翼电子科技有限公司 2009-2019
//All rights reserved									  
//////////////////////////////////////////////////////////////////////////////////  
								    
//按键初始化函数
void KEY_Init(void) //IO初始化
{ 
 	GPIO_InitTypeDef GPIO_InitStructure;
 
 	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);//使能PORTA,PORTE时钟

	GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;//KEY0-KEY1
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; //设置成上拉输入
 	GPIO_Init(GPIOB, &GPIO_InitStructure);//初始化GPIOE4,3

}

void MQ_Init(void) //IO初始化
{ 
 	GPIO_InitTypeDef GPIO_InitStructure;
 
 	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);//使能PORTA,PORTE时钟

	GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_5;//KEY0-KEY1
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; //设置成上拉输入
 	GPIO_Init(GPIOB, &GPIO_InitStructure);//初始化GPIOE4,3

}

//按键处理函数
//返回按键值
//mode:0,不支持连续按;1,支持连续按;
//0，没有任何按键按下
//1，KEY0按下
//2，KEY1按下
//3，KEY3按下 WK_UP
//注意此函数有响应优先级,KEY0>KEY1>KEY_UP!!
u8 KEY_Scan(u8 mode)
{	 
	static u8 key_up=1;//按键按松开标志
	if(mode)key_up=1;  //支持连按		
	if(key_up&&KEY1==0)
	{
		delay_ms(20);//去抖动
		key_up=0;
		if(KEY1==0)return  KEY1_PRES;	

	}
	if(key_up&&KEY2==0)
	{
		delay_ms(20);//去抖动
		key_up=0;
		if(KEY2==0)return  KEY2_PRES;	
	}
	if(key_up&&KEY3==0)
	{
		delay_ms(20);//去抖动
//		delay_ms(50);//去抖动
		key_up=0;
		if(KEY3==0)return  KEY3_PRES;	
	}
	if(key_up&&KEY4==0)
	{
		delay_ms(20);//去抖动
		key_up=0;
		if(KEY4==0)return  KEY4_PRES;
	}
	if(KEY1==1&&KEY2==1&&KEY3==1&&KEY4==1)
	{
		key_up=1; 	   
		return 0;// 无按键按下
	}
}

u8 MQ_Scan(void )
{
    
	if(MQ==0)
	{
		delay_ms(20);//去抖动
		if(MQ==0)return  1;	
    else
        return 0;
    
	}
}


